# Pandas: Reading and Writing Data
## Using I/O API Tools

## CSV and Textual Files (pg. 142)
Everyone has become accustomed over the years to writing and reading files in text
form. In particular, data are generally reported in tabular form. If the values in a row are
separated by commas, you have the CSV (comma-separated values) format, which is
perhaps the best-known and most popular format. <br>
Other forms of tabular data can be separated by spaces or tabs and are typically
contained in text files of various types (generally with the .txt extension). <br>
This type of file is the most common source of data and is easier to transcribe and
interpret. In this regard, pandas provides a set of functions specific for this type of file.<br>
    -read_csv
    -read_table
    -to_csv

In [4]:
import numpy as np
import pandas as pd

<b>Listing 5-1. ch05_01.csv </b>
<code>
white,red,blue,green,animal
1,5,2,3,cat
2,7,8,5,dog
3,3,6,7,horse
2,2,8,3,duck
4,4,2,1,mouse
</code>

In [ ]:
help (pd.read_csv)

In [12]:
csvframe = pd.read_csv('ch05_01.csv')
csvframe.head() # read 5 lines

   white  red  blue  green animal
0      1    5     2      3    cat
1      2    7     8      5    dog
2      3    3     6      7  horse
3      2    2     8      3   duck
4      4    4     2      1  mouse

As you can see, reading the data in a CSV file is rather trivial. CSV files are tabulated
data in which the values on the same column are separated by commas. Since CSV files
are considered text files, you can also use the read_table() function, but specify the
delimiter.

In [13]:
csvframe1 = pd.read_table('ch05_01.csv',sep=',')
csvframe1.tail()

   white  red  blue  green animal
0      1    5     2      3    cat
1      2    7     8      5    dog
2      3    3     6      7  horse
3      2    2     8      3   duck
4      4    4     2      1  mouse

### Files without header
<b>Listing 5-2. ch05_02.csv</b>
<code>
1,5,2,3,cat
2,7,8,5,dog
3,3,6,7,horse
2,2,8,3,duck
4,4,2,1,mouse
</code>

In [14]:
frame1 = pd.read_csv('ch05_02.csv', header=None)
frame1

   0  1  2  3      4
0  1  5  2  3    cat
1  2  7  8  5    dog
2  3  3  6  7  horse
3  2  2  8  3   duck
4  4  4  2  1  mouse

In [20]:
#help (pd.read_csv)
pd.read_csv('ch05_02.csv', names=['white','red','blue','green','animal'])

   white  red  blue  green animal
0      1    5     2      3    cat
1      2    7     8      5    dog
2      3    3     6      7  horse
3      2    2     8      3   duck
4      4    4     2      1  mouse

In more complex cases, in which you want to create a dataframe with a hierarchical
structure by reading a CSV file, you can extend the functionality of the read_csv() function
by adding the index_col option, assigning all the columns to be converted into indexes.<br>
To better understand this possibility, create a new CSV file with two columns to be
used as indexes of the hierarchy. Then, save it in the working directory as ch05_03.csv 
(see Listing 5-3).<br>
<b>Listing 5-3. ch05_03.csv</b>
<code>
color,status,item1,item2,item3
black,up,3,4,6
black,down,2,6,7
white,up,5,5,5
white,down,3,3,2
white,left,1,2,1
red,up,2,2,2
red,down,1,1,4
</code>

In [22]:
pd.read_csv('ch05_03.csv', index_col=['color','status'])

              item1  item2  item3
color status
black up          3      4      6
      down        2      6      7
white up          5      5      5
      down        3      3      2
      left        1      2      1
red   up          2      2      2
      down        1      1      4

### Using RegExp to Parse TXT Files (pg 147)
In other cases, it is possible that the files on which to parse the data do not show
separators well defined as a comma or a semicolon. In these cases, the regular
expressions come to our aid. In fact, you can specify a regexp within the read_table()
function using the sep option.<br>
To better understand regexp and understand how you can apply it as criteria for
value separation, let’s start with a simple case. For example, suppose that your TXT
file has values that are separated by spaces or tabs in an unpredictable order. In this
case, you have to use the regexp, because that’s the only way to take into account both
separator types. You can do that using the wildcard /s*. /s stands for the space or tab
character (if you want to indicate a tab, you use /t), while the asterisk indicates that
there may be multiple characters (see Table 5-1 for other common wildcards). That is,
the values may be separated by more spaces or more tabs.<br>
<code>
Table 5-1. Metacharacters
. Single character, except newline
\d Digit
\D Non-digit character
\s Whitespace character
\S Non-whitespace character
\n New line character
\t Tab character
\uxxxx Unicode character specified by the
hexadecimal number xxxx</code>
<br>
Take for example an extreme case in which we have the values separated by tabs or
spaces in a random order <br>

<b>Listing 5-4. ch05_04.txt</b>
<code>
white red blue green
1 5 2 3
2 7 8 5
3 3 6 7
</code>

In [31]:
frame = pd.read_table('ch05_04.txt', sep='\s+',engine='python')
frame

              white red   blue green
1 5                        NaN   2 3
2 7                       8  5  None
  3  3  6   7             None  None

In [28]:
COLS = ['FIRST', 'SECOND', 'THIRD']
INDX = [1,2,3]
frame.columns = COLS
frame.index = INDX
frame

   FIRST  SECOND  THIRD
1      0     123    122
2      1     124    321
3      2     125    333

Remember to set the header option to None whenever the column headings are not
present in the TXT file (see Listing 5-5). <br>
    - \D Non-digit character
</b>Listing 5-5. ch05_05.txt</b>
<code>
000END123AAA122
001END124BBB321
002END125CCC333
</code>

In [29]:
pd.read_table('ch05_05.txt', sep='\D+', header=None, engine='python')

   white  red  blue  green
0      1    5     2      3
1      2    7     8      5
2      3    3     6      7

Another fairly common event is to exclude lines from parsing. In fact you do not always
want to include headers or unnecessary comments contained in a file (see Listing 5-6).
With the skiprows option, you can exclude all the lines you want, just assigning an array
containing the line numbers to not consider in parsing.<br>
Pay attention when you are using this option. If you want to exclude the first five
lines, you have to write skiprows = 5, but if you want to rule out the fifth line, you have
to write skiprows = [5].<br>
<b>Listing 5-6. ch05_06.txt</b>
<code>
########### LOG FILE ############
This file has been generated by automatic system
white,red,blue,green,animal
12-Feb-2015: Counting of animals inside the house
1,5,2,3,cat
2,7,8,5,dog
13-Feb-2015: Counting of animals outside the house
3,3,6,7,horse
2,2,8,3,duck
4,4,2,1,mous
</code>

In [34]:
pd.read_table('ch05_06.txt',sep=',',skiprows=[0,1,3,6])

   white  red  blue  green animal
0      1    5     2      3    cat
1      2    7     8      5    dog
2      3    3     6      7  horse
3      2    2     8      3   duck
4      4    4     2      1  mouse

## Reading TXT Files Into Parts
When large files are processed, or when you are only interested in portions of these files,
you often need to read the file into portions (chunks). This is both to apply any iterations
and because we are not interested in parsing the entire file.<br>
If, for example, you wanted to read only a portion of the file, you can explicitly specify
the number of lines on which to parse. Thanks to the nrows and skiprows options, you
can select the starting line n (n = SkipRows) and the lines to be read after it (nrows = i).

<b>Listing 5-2. ch05_02.csv</b>
<code>
1,5,2,3,cat
2,7,8,5,dog
3,3,6,7,horse
2,2,8,3,duck
4,4,2,1,mouse
</code>

In [37]:
pd.read_csv('ch05_02.csv',skiprows=[2,3],nrows=3,header=None)

   0  1  2  3      4
0  1  5  2  3    cat
1  2  7  8  5    dog
2  4  4  2  1  mouse

Another interesting and fairly common operation is to split into portions that part of
the text on which you want to parse. Then, for each portion a specific operation may be
carried out, in order to obtain an iteration, portion by portion.
For example, you want to add the values in a column every three rows and then
insert these sums in a series. This example is trivial and impractical but is very simple
to understand, so once you have learned the underlying mechanism, you will be able to
apply it in more complex cases.

<b>Listing 5-1. ch05_01.csv </b>
<code>
white,red,blue,green,animal
1,5,2,3,cat
2,7,8,5,dog
3,3,6,7,horse
2,2,8,3,duck
4,4,2,1,mouse
</code>

In [44]:
out = pd.Series()
i = 0
pieces = pd.read_csv('ch05_01.csv',chunksize=3)
for piece in pieces:
    out.set_value(i,piece['white'].sum())
    i = i + 1
out

C:\Users\rusla\Anaconda3\lib\site-packages\ipykernel_launcher.py:5: FutureWarning: set_value is deprecated and will be removed in a future release. Please use .at[] or .iat[] accessors instead
  """

0    3
1    5
2    4
dtype: int64

## Writing Data in CSV
In addition to reading the data contained in a file, it’s also common to write a data file
produced by a calculation, or in general the data contained in a data structure.<br>
For example, you might want to write the data contained in a dataframe to a CSV
file. To do this writing process, you will use the to_csv() function, which accepts as an
argument the name of the file you generate (see Listing 5-7).<br>

In [46]:
frame = pd.DataFrame(np.arange(16).reshape((4,4)),
index = ['red', 'blue', 'yellow', 'white'],
columns = ['ball', 'pen', 'pencil', 'paper'])

frame.to_csv('ch05_07.csv')

In [47]:
frame

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

The result is:
    <img src="ch05_07.gif" align="left" height="250" width="250"></img>

In [49]:
# Header False
frame.to_csv('ch05_07b.csv', align="right"index=False, header=False)

The result is:
    <img src="ch05_07b.gif" align="left" height="250" width="250"></img>

In [51]:
frame3 = pd.DataFrame([[6,np.nan,np.nan,6,np.nan],
    [np.nan,np.nan,np.nan,np.nan,np.nan],
    [np.nan,np.nan,np.nan,np.nan,np.nan],
    [20,np.nan,np.nan,20.0,np.nan],
    [19,np.nan,np.nan,19.0,np.nan]
    ],
index=['blue','green','red','white','yellow'],
columns=['ball','mug','paper','pen','pencil'])
frame3

        ball  mug  paper   pen  pencil
blue     6.0  NaN    NaN   6.0     NaN
green    NaN  NaN    NaN   NaN     NaN
red      NaN  NaN    NaN   NaN     NaN
white   20.0  NaN    NaN  20.0     NaN
yellow  19.0  NaN    NaN  19.0     NaN

In [52]:
frame3.to_csv('ch05_08.csv') #Please look at the result

The result is:
    <img src="ch05_08.gif" align="left" height="250" width="250"></img>

In [54]:
frame3.to_csv('ch05_09.csv', na_rep ='NaN') #Please look at the result

The result is:
    <img src="ch05_09.gif" align="left" height="250" width="250"></img>

## Reading and Writing HTML Files
pandas provides the corresponding pair of I/O API functions for the HTML format.<br>
    - read_html()
    - to_html()
These two functions can be very useful. You will appreciate the ability to convert complex data structures such as dataframes directly into HTML tables without having to hack a long listing in HTML, especially if you’re dealing with the Web.<br>
The inverse operation can be very useful, because now the major source of data is just the web world. In fact, a lot of data on the Internet does not always have the form “ready to use,” that is packaged in some TXT or CSV file. Very often, however, the data are reported as part of the text of web pages. So also having available a function for reading could prove to be really useful.<br>
This activity is so widespread that it is currently identified as web scraping. This process is becoming a fundamental part of the set of processes that will be integrated in the first part of data analysis: data mining and data preparation.
    
<code>
Note Many websites have now adopted the HTML5 format, to avoid any issues of
missing modules and error messages. I strongly recommend you install the module
html5lib. Anaconda specified:
    
conda install html5lib
</code>

## Writing Data in HTML
Now you learn how to convert a dataframe into an HTML table. The internal structure of the dataframe is automatically converted into nested tags <TH>, <TR>, and <TD> retaining any internal hierarchies. You do not need to know HTML to use this kind offunction.<br>
Because the data structures as the dataframe can be quite complex and large, it’s great to have a function like this when you need to develop web pages.
To better understand this potential, here’s an example. You can start by defining a simple dataframe. <br>
Thanks to the to_html() function, you can directly convert the dataframe into an HTML table.

In [55]:
frame = pd.DataFrame(np.arange(4).reshape(2,2))
print(frame.to_html())

<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>0</th>
      <th>1</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>0</td>
      <td>1</td>
    </tr>
    <tr>
      <th>1</th>
      <td>2</td>
      <td>3</td>
    </tr>
  </tbody>
</table>

In [59]:
def generate_html(frame):
    s = ['<HTML>']
    s.append('<HEAD><TITLE>My DataFrame</TITLE></HEAD>')
    s.append('<BODY>')
    s.append(frame.to_html())
    s.append('</BODY></HTML>')
    return "".join(s)

def writeToHTML(frame, fileName2Write):
    html_file = open(fileName2Write,'w')
    html_file.write(generate_html(frame))
    html_file.close()

writeToHTML (frame, "theHTML.html") #the filename

#Now, you task is to design and write a class to perform the task (optional)

The result is:
    <img src="theHTML.gif" align="left" height="450" width="450"></img>

In [61]:
# Another Example:
frame = pd.DataFrame( np.random.random((4,4)),
    index = ['white','black','red','blue'],
    columns = ['up','down','right','left'])
frame

             up      down     right      left
white  0.568019  0.427437  0.091785  0.101310
black  0.444635  0.308576  0.583043  0.773608
red    0.028112  0.017620  0.082154  0.659937
blue   0.296298  0.395313  0.625446  0.844928

In [62]:
writeToHTML (frame, "theHTML1.html") #the filename

The result is:<br>
    <img src="theHTML1.gif" align="left" height="250" width="250"></img>

### Reading Data from an HTML File
As you just saw, pandas can easily generate HTML tables starting from the dataframe.
The opposite process is also possible; the function read_html () will perform a parsing
an HTML page looking for an HTML table. If found, it will convert that table into an
object dataframe ready to be used in our data analysis.<br>
More precisely, the read_html() function returns a list of dataframes even if there is
only one table. The source that will be parsed can be different types. For example, you
may have to read an HTML file in any directory. For example you can parse the HTML
file you created in the previous example:

In [64]:
web_frames = pd.read_html('theHTML1.html')

In [67]:
web_frames

[  Unnamed: 0        up      down     right      left
 0      white  0.568019  0.427437  0.091785  0.101310
 1      black  0.444635  0.308576  0.583043  0.773608
 2        red  0.028112  0.017620  0.082154  0.659937
 3       blue  0.296298  0.395313  0.625446  0.844928]

In [68]:
web_frames[0]

  Unnamed: 0        up      down     right      left
0      white  0.568019  0.427437  0.091785  0.101310
1      black  0.444635  0.308576  0.583043  0.773608
2        red  0.028112  0.017620  0.082154  0.659937
3       blue  0.296298  0.395313  0.625446  0.844928

In [76]:
ranking = pd.read_html('http://www.meccanismocomplesso.org/en/meccanismo-complesso-sito-2/classifica-punteggio/')
ranking[0].head()

   #         Nome    Exp  Livelli
0  1  Fabio Nelli  17842      NaN
1  2        admin   9029      NaN
2  3  BrunoOrsini   2168      NaN
3  4    Berserker    700      NaN
4  5     Dnocioni    556      NaN

## Reading Data from XML
In the list of I/O API functions, there is no specific tool regarding the XML (Extensible Markup Language) format. In fact, although it is not listed, this format is very important, because many structured data are available in XML format. This presents no problem, since Python has many other libraries (besides pandas) that manage the reading andwriting of data in XML format.<br><br>
One of these libraries is the lxml library, which stands out for its excellent
performance during the parsing of very large files. In this section you learn how to use
this module for parsing XML files and how to integrate it with pandas to finally get the
dataframe containing the requested data. For more information about this library, I
highly recommend visiting the official website of lxml at http://lxml.de/index.html.
Take for example the XML file shown in Listing 5-11. Write down and save it with the
name books.xml directly in your working directory.<br>
<b>Listing 5-11. books.xml</b>

<textarea rows="17" cols="60" align="left" >
<?xml version="1.0"?>
<Catalog>
<Book id="ISBN9872122367564">
<Author>Ross, Mark</Author>
<Title>XML Cookbook</Title>
<Genre>Computer</Genre>
<Price>23.56</Price>
<PublishDate>2014-22-01</PublishDate>
</Book>
<Book id="ISBN9872122367564">
<Author>Bracket, Barbara</Author>
<Title>XML for Dummies</Title>
<Genre>Computer</Genre>
<Price>35.95</Price>
<PublishDate>2014-12-16</PublishDate>
</Book>
</Catalog>
</textarea>

In [78]:
from lxml import objectify

In [80]:
xml = objectify.parse('books.xml')
xml

In [82]:
root = xml.getroot()
root

In [83]:
root.Book.Author

'Ross, Mark'

In [84]:
root.Book.PublishDate

'2014-22-01'

In [85]:
root.getchildren()

In [86]:
[child.tag for child in root.Book.getchildren()]

['Author', 'Title', 'Genre', 'Price', 'PublishDate']

In [87]:
[child.text for child in root.Book.getchildren()]

['Ross, Mark', 'XML Cookbook', 'Computer', '23.56', '2014-22-01']

In [97]:
def etree2df(root):
    column_names = []
    for i in range(0,len(root.getchildren()[0].getchildren())):
        column_names.append(root.getchildren()[0].getchildren()[i].tag)
    xml_frame= pd.DataFrame(columns=column_names)
    for j in range(0, len(root.getchildren())):
        obj = root.getchildren()[j].getchildren()
        texts = []
        for k in range(0, len(column_names)):
            texts.append(obj[k].text)
        row = dict(zip(column_names, texts))
        row_s = pd.Series(row)
        row_s.name = j
        xml_frame = xml_frame.append(row_s)
    return xml_frame

etree2df(root)

             Author            Title     Genre  Price PublishDate
0        Ross, Mark     XML Cookbook  Computer  23.56  2014-22-01
1  Bracket, Barbara  XML for Dummies  Computer  35.95  2014-12-16

## Reading and Writing Data on Microsoft Excel Files
In the previous section, you saw how the data can be easily read from CSV files. It is
not uncommon, however, that there are data collected in tabular form in an Excel
spreadsheet. <br>
pandas provides specific functions for this type of format. You have seen that the I/O
API provides two functions to this purpose:
    - to_excel()
    - read_excel()
The read_excel() function can read Excel 2003 (.xls) files and Excel 2007 (.xlsx) files.
This is possible thanks to the integration of the internal module xlrd. <br>
First, open an Excel file and enter the data as shown in Figure 5-2. Copy the data in
sheet1 and sheet2. Then save it as ch05_data.xlsx.

In [99]:
pd.read_excel('ch05_data.xlsx')

   white  red  green  black
0     12   23     17     18
1     22   16     19     18
2     14   23     22     21

In [101]:
pd.read_excel('ch05_data.xlsx','Sheet2')

   yellow  purple  blue  orange
A    11.0    11.0  44.0    22.0
B    20.0    20.0  23.0    44.0
C    30.0    30.0  37.0    32.0
D     NaN     NaN   NaN     NaN

In [102]:
# To Write:
frame = pd.DataFrame(np.random.random((4,4)),
    index = ['exp1','exp2','exp3','exp4'],
    columns = ['Jan2015','Fab2015','Mar2015','Apr2005'])
frame

       Jan2015   Fab2015   Mar2015   Apr2005
exp1  0.319257  0.774840  0.369734  0.612246
exp2  0.924129  0.630677  0.050175  0.776656
exp3  0.654918  0.027734  0.496637  0.104759
exp4  0.159117  0.992891  0.450376  0.960502

In [103]:
frame.to_excel('data2.xlsx')

##JSON Data
JSON (JavaScript Object Notation) has become one of the most common standard
formats, especially for the transmission of data on the Web. So it is normal to work with
this data format if you want to use data on the Web.<br>
The special feature of this format is its great flexibility, although its structure is far
from being the one to which you are well accustomed, i.e., tabular.
In this section you will see how to use the read_json() and to_json() functions to
stay within the I/O API functions discussed in this chapter. But in the second part you
will see another example in which you will have to deal with structured data in JSON
format much more related to real cases.<br>
In my opinion, a useful online application for checking the JSON format is
JSONViewer, available at http://jsonviewer.stack.hu/. This web application, once
you enter or copy data in JSON format, allows you to see if the format you entered
is valid. Moreover it displays the tree structure so that you can better understand its
structure (see Figure 5-4) -pg. 163.<br>
<img src="JSON Viewer.gif" align="left" height="250" width="250"></img>

In [104]:
frame = pd.DataFrame(np.arange(16).reshape(4,4),
    index=['white','black','red','blue'],
    columns=['up','down','right','left'])
frame.to_json('frame.json') # generate JSON file

In [105]:
pd.read_json('frame.json')

       up  down  right  left
black   4     5      6     7
blue   12    13     14    15
red     8     9     10    11
white   0     1      2     3

## Interacting with Databases (pg. 170)
In many applications, the data rarely come from text files, given that this is certainly not
the most efficient way to store data.<br>
The data are often stored in an SQL-based relational database, and also in many
alternative NoSQL databases that have become very popular in recent times.
Loading data from SQL in a dataframe is sufficiently simple and pandas has some
functions to simplify the process.<br>
The pandas.io.sql module provides a unified interface independent of the DB,
called sqlalchemy. This interface simplifies the connection mode, since regardless of the
DB, the commands will always be the same. To make a connection you use the create_
engine() function. With this feature you can configure all the properties necessary to
use the driver, as a user, password, port, and database instance. <br>
Here is a list of examples for the various types of databases: <br>
<pre>
>>> from sqlalchemy import create_engine
For PostgreSQL:
>>> engine = create_engine('postgresql://scott:tiger@localhost:5432/mydatabase')
For MySQL
>>> engine = create_engine('mysql+mysqldb://scott:tiger@localhost/foo')
For Oracle
>>> engine = create_engine('oracle://scott:tiger@127.0.0.1:1521/sidname')
For MSSQL
>>> engine = create_engine('mssql+pyodbc://mydsn')
For SQLite
>>> engine = create_engine('sqlite:///foo.db')
</pre>

### Loading and Writing Data with SQLite3
As a first example, you will use a SQLite database using the driver’s built-in Python
sqlite3. SQLite3 is a tool that implements a DBMS SQL in a very simple and lightweight
way, so it can be incorporated in any application implemented with the Python
language. In fact, this practical software allows you to create an embedded database in a
single file.<br>
This makes it the perfect tool for anyone who wants to have the functions of a
database without having to install a real database. SQLite3 could be the right choice
for anyone who wants to practice before going on to a real database, or for anyone who
needs to use the functions of a database to collect data, but remaining within a single
program, without having to interface with a database.<br>
Create a dataframe that you will use to create a new table on the SQLite3 database.

In [2]:
import pandas as pd
import numpy as np

frame = pd.DataFrame( np.arange(20).reshape(4,5),
    columns=['white','red','blue','black','green'])
frame

   white  red  blue  black  green
0      0    1     2      3      4
1      5    6     7      8      9
2     10   11    12     13     14
3     15   16    17     18     19

In [126]:
#Example using sqlite 3 to create table.
import sqlite3

conn = sqlite3.connect('foo.db')  # You can create a new database by changing the name within the quotations
c = conn.cursor() # The database will be saved in the location where your 'py' file is saved

# Create table - CLIENTS
c.execute('''CREATE TABLE CLIENTS
             ([generated_id] INTEGER PRIMARY KEY,[Client_Name] text, [Country_ID] integer, [Date] date)''')
          
# Create table - COUNTRY
c.execute('''CREATE TABLE COUNTRY
             ([generated_id] INTEGER PRIMARY KEY,[Country_ID] integer, [Country_Name] text)''')
        
# Create table - DAILY_STATUS
c.execute('''CREATE TABLE DAILY_STATUS
             ([Client_Name] text, [Country_Name] text, [Date] date)''')
                 
conn.commit()

In [4]:
#Using sqlachemy

from sqlalchemy import create_engine

#Now it’s time to implement the connection to the SQLite3 database.
engine = create_engine('sqlite:///foo.db')

#Convert the dataframe in a table within the database.
frame.to_sql('colors1',engine)

In [9]:
#Instead, to read the database, you have to use the read_sql() function with the name of the table and the engine.
pd.read_sql ('colors1',engine)
#frame.read_sql?

   index  white  red  blue  black  green
0      0      0    1     2      3      4
1      1      5    6     7      8      9
2      2     10   11    12     13     14
3      3     15   16    17     18     19